---
type: RevitLinkOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# RevitLinkOptions

`Autodesk.Revit.DB.RevitLinkOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RevitLinkOptions | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetWorksetConfiguration | 2014 | `public WorksetConfiguration GetWorksetConfiguration ()` |
| Method | SetWorksetConfiguration | 2014 | `public void SetWorksetConfiguration ( WorksetConfiguration config )` |
| Property | IsRelative | 2013 | `public bool IsRelative { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |